{
    "menu": {
            "item1": "Home",
            "item2": "About",
            "item3": "Skills",
            "item4": "Experience",
            "item5": "Education",
            "item6": "Certifications"
        },
    "about": {
        "title": "Software Engineer",
        "description": "An in love of technology, always trying to improve my own skills. With the ability and the required experience to design and execute informatics projects, either single or in a team. I'm appreciated for be a person with a great sense of accountability and compromise with the assigned projects. Great ability to problem resolution and analysis. Someone that always tries to go beyond his tasks, looking for the best way to do the things.",
        "button": "More at Github!"

    },
    "web":{
        "item1":"Experience working with FRONTEND technologies (HTML5, CSS3, JS)",
        "item2": "CSS frameworks (Materialize, Bootstrap)",
        "item3":"JAVASCRIPT Frameworks on different flavors (ANGULARJS, REACTJS, BACKBONE)",
        "item4":"Experience on MVC pattern or oriented services architectures (RESTful)"
    },
    "backend":{
        "item1": "Wide knowledge in systems JAVA EE by using different Frameworks (SPRING various flavors, JSF, STRUTS2)",
        "item2": "Experience developing in PYTHON, RESTful services on different Frameworks, further of SCRIPTS automation",
        "item3": "Experience in RESTful services developed by using RUBY",
        "item4": "Experience developing RESTful services and module creation in NODEJS",
        "item5": "Knowledge in other languages (PHP, SCALA, DELPHI, C++, C#)",
        "item6": "Experience in different server applications (JBOSS, GLASSFISH, WEBLOGIC, etc)",
        "item7": "Experience developing systems by using ORACLE FORMS",
        "item8": "Experience in reports, by using technologies such as JASPER or ORACLE REPORTS BUILDER"
    },
    "db":{
        "item1":"Wide SQL knowledge on different databases",
        "item2": "Experience on databases such as ORACLE, POSTGRESQL, MYSQL, SQL SERVER, etc",
        "item3": "Knowledge on databases NOSQL, such as MONGODB",
        "item4": "Experience on develop PL/SQL scripts"
    },
    "others":{
        "item1":"Advanced technical English",
        "item2":"Experience working under development methods such as SCRUM and AGILE",
        "item3":"Great ability to problem resolution and analysis",
        "item4": "Self-learning",
        "item5": "Able to develop projects single or in a team",
        "item6": "Wide knowledge on environments LINUX, WINDOWS and MAC OS"
    },
    "work":{
        "title": "Experience",
        "rossmon":[
            {
                "title":"Software Developer at Rossmon",
                "time": "2013 - 2014",
                "project": "Project: Sistema de Plantillas Web",
                "description": "I was involved in multiple projects, using different kind of technologies, such as Java, Oracle Forms and web technologies (Javascript, HTML, CSS). Furthermore, I worked with some different data bases such as Oracle, Postgresql and MySql. One of the projects was the development of a financial software in order to control financial assets and liabilities for a national entity called JASEC."
            }
        ],
        "snap":[
            {
                "title":"Software Developer at Snap Technology",
                "time": "2014 - 2016",
                "project": "Application Support Team",
                "description1": "I was responsible primarily for keeping the application in production environment, up and running properly. To accomplish that, I had to run SQL scripts in order to perform data fixing of the production data. By doing that almost daily, I was able to improve my SQL knowledge. One cool thing that I made here was the automation of the data fixing process by making PLSQL scripts and the creation of a module in the main application, where anybody of the team was able to perform the most recurring tasks, by doing this, the response time was minized, that allowed the team to focus on other tasks. Also, when a bug in the application appeard, I was responsible to analyze what was happening and implement a code solution. The main application was developed mainly in Java, so I was able to also improve my Java skills."
            },
            {
                "title":"Software Developer at Snap Technology",
                "time": "2014 - 2016",
                "project": "Research and Development team",
                "description1": "I was responsible for creating new modules for the main application, furthermore, the creation of improvements. The main duty was the researching of new technologies that could help on the company growth, taking advantage of my knowledge about the business of the company. Different technologies were involved on this position, mainly Java."
            }
        ],
        "gl":[
          {
            "title":"Software Engineer at Gorilla Logic",
            "time": "2016 - Currently",
            "project": "Digital Globe",
            "description1": "I was involved in a project for maintaining an OAuth2 library, which was developed in three different languages: Java, Ruby and Python. I worked mainly on the Python version, but also I have interaction with the others languages. Also, because of the OAuth2 protocol, I learned about some security concepts and the RESTful architecture that was implemented in the library.",
            "description2": "Besides, I was involved in a project for maintaining a messaging broker service, using Apache AMQ as the server, and improving the stack of applications developed in Java, using the framework Spring. Furthermore, I was responsible for creating an administration tool from scratch, that was developed using a server side developed in Java(Spring), and a frontend side developed in AngularJs. I was involved in both sides of the application."
          }
        ]
    },
    "education":{
        "title":"Education",
        "titles":[
            {
                "university":"CUC",
                "time":"2011 - 2014",
                "title":"University Degree as Software Developer"
            },
            {
                "university":"UMCA",
                "time":"2014 - 2016",
                "title":"Bachelor Degree as Computer Engineering"
            }
        ]
    },
    "certs":{
      "title":"Certifications",
      "titles":[
        {
          "tech":"JAVA 7",
          "description":"Oracle Certified Associate, JAVA SE 7 Programmer"
        }
      ]
    }
}
