{
    "menu": {
            "item1": "Inicio",
            "item2": "Acerca de",
            "item3": "Experience",
            "item4": "Conocimientos",
            "item5": "Educación",
            "item6": "Certificaciones"
        },
    "about": {
        "title": "Ingeniero en Software",
        "description": "Un apasionado de la tecnología, siempre en la búsqueda de mejorar mis propias habilidades. Con la habilidad y la experiencia necesaria para diseñar y ejecutar proyectos informáticos, ya sea solo o trabajando en equipo. Me caracterizo por ser una persona con gran sentido de la responsabilidad y compromiso para con los proyectos asignados. Gran habilidad para la resolución de problemas y análisis. Una persona que siempre va más allá de sus tareas, buscando siempre la mejor manera de hacer las cosas.",
        "button": "Más en Github!"

    },
    "web":{
        "item1": "Experiencia trabajando con tecnologías FRONTEND (HTML5, CSS3, JS).",
        "item2": "Frameworks CSS (Materialize, Bootstrap)",
        "item3": "Frameworks JAVASCRIPT en diferentes sabores (ANGULARJS, REACTJS, BACKBONE)",
        "item4": "Experiencia en patrones de diseño orientados a MVC o arquitecturas orientadas a servicios (RESTful)"
    },
    "backend":{
        "item1": "Amplio conocimiento en sistemas JAVA EE usando diferentes Frameworks (SPRING diferentes sabores, JSF, STRUTS2)",
        "item2": "Experiencia desarrollando en PYTHON, servicios RESTful en diferentes Frameworks, ademas de automatizacion de SCRIPTS",
        "item3": "Experiencia en servicios RESTful desarrollados en lenguaje RUBY",
        "item4": "Experiencia desarrollando servicios RESTful y creacion de modulos en NODEJS",
        "item5": "Conocimiento en otros lenguajes (PHP, SCALA, DELPHI, C++, C#)",
        "item6": "Experiencia en diferentes servidores de aplicaciones (JBOSS, GLASSFISH, WEBLOGIC, etc)",
        "item7": "Experiencia desarrollando sistemas bajo ORACLE FORMS",
        "item8": "Experiencia en reportes en tecnologías tales como JASPER u ORACLE REPORTS BUILDER"
    },
    "db":{
        "item1": "Amplio conocimiento SQL en diferentes motores",
        "item2": "Experiencia y conocimiento en motores SQL tales como ORACLE, POSTGRESQL, MYSQL, SQL SERVER, etc",
        "item3": "Conocimiento en bases de datos NOSQL tales como MONGODB",
        "item4": "Experiencia en desarrollo de scripts PL/SQL"
    },
    "others":{
        "item1": "Ingles técnico avanzado",
        "item2": "Experiencia trabajando bajo metodologias de desarrollo como SCRUM y AGILE",
        "item3": "Gran habilidad para el análisis y resolución de problemas",
        "item4": "Autodidacta",
        "item5": "Capacidad para desarrollar proyectos solo o en equipo",
        "item6": "Amplio conocimiento en ambientes LINUX, WINDOWS y MAC OS"
    },
    "work":{
        "title": "Experiencia",
        "rossmon":[
            {
                "title":"Desarrollador en Rossmon S.A",
                "time": "2013 – 2014",
                "project": "Proyecto: Sistema de Plantillas Web",
                "description": "Estuve involucrado en varios proyectos usando diferentes tecnologías, tales como Java, Oracle Forms y tecnologias web (Javascript, HTML, CSS). Además, trabaje con distintas bases de datos: Oracle, Postgresql y MySql. Uno de los proyectos fue el desarrollo de un sistema financiero para el control de Activos y Pasivos financieros de la entidad nacional JASEC."
            }
        ],
        "snap":[
            {
                "title":"Developer en Snap Technology",
                "time": "2014 – 2016",
                "project": "Equipo: Application Support Team",
                "description1": "Era el responsable de mantener corriendo la aplicación en producción. Para lograrlo, diariamente tenia que realizar data fixing en base de datos, lo que mejoro mis habilidades y conocimientos en SQL. Algo interesante que pude lograr fue la automatización del proceso de data fixing haciendo scripts PLSQL. Además cree un modulo en la aplicación, donde cualquiera del equipo puede ejecutar las tareas mas recurrentes. Esto ayudo a que el tiempo de respuesta fuera minimizado, permitiendo al equipo a enfocarse en otras tareas. Además, cuando un bug aparecía en la aplicación de producción, era responsable de analizar el problema e implementar una solución en código. La aplicacion era desarrollada principalmente en Java, por lo cual pude mejorar mi conocimiento en dicho lenguaje."
                },
            {
                "title":"Developer en Snap Technology",
                "time": "2014 – 2016",
                "project": "Equipo: Research and Development",
                "description1": "Responsable de la creación de nuevos módulos dentro de la aplicación principal, además de la creación de mejoras en los módulos ya existentes. Mi tarea principal fue el estudio de nuevas tecnologías que pudieran ayudar al crecimiento de la compañía, aprovechando mi conocimiento acerca del negocio. Trabaje con diferentes tecnologías, pero principalmente Java."
            }
        ],
        "gl":[
          {
            "title":"Software Engineer en Gorilla Logic",
            "time": "2016 - Actualmente",
            "project": "Digital Globe",
            "description1": "Fui asignado a un proyecto para el mantenimiento de una librería OAuth2, que fue desarrollada en tres lenguajes: Java, Ruby y Python. Trabaje principalmente en la versión de Python, pero también tuve interacción con los demás lenguajes. Además debido al protocolo OAuth2, tuve la oportunidad de aprender sobre conceptos de seguridad en arquitecturas RESTful.",
            "description2": "Luego fui asignado al mantenimiento de un servicio broker de mensajería, que usa Apache AMQ como servidor, y además mejorar el stack actual de aplicaciones desarrolladas en Java (Spring). También fui responsable en la creación de una herramienta de administración desde cero para dicho stack. El lado del servidor fue desarrollado en Java (Spring) y un UI en AngularJs."
          }
        ]
    },
    "education":{
        "title":"Educación",
        "titles":[
            {
                "university":"CUC",
                "time":"2011 - 2014",
                "title":"Diplomado Programación de Sistemas"
            },
            {
                "university":"UMCA",
                "time":"2014 - 2016",
                "title":"Bachillerato Ingeniería en Informática"
            }
        ]
    },
    "certs":{
      "title":"Certificaciones",
      "titles":[
        {
          "tech":"JAVA 7",
          "description":"Oracle Certified Associate, JAVA SE 7 Programmer"
        }
      ]
    }
}
